class Arabic {
  Map<String, String> get keys => {
    ///===========================================================================
    /// Splash Screen
    'language': 'اللغة',
    'No Internet Connection Available': 'لا يوجد اتصال متاح بالإنترنت',
    'Connection Time Out Please try again':
        'إنتهت مهلة الاتصال بالانترنت يرجى المحاولة مرة اخرى',
    'Something Went Wrong Please try again':
        'حدث خطأ ما يرجى المحاولة مرة اخرى',
    'Retry': 'إعادة المحاولة',
    'Powered by PST': 'Powered by PST',

    ///===========================================================================
    /// Onboarding Screen
    'onboarding_title_1': 'اكتشف طريقة جديدة للتسوق، أسرع وأسهل من أي وقت مضى!',
    'onboarding_sub_title_1':
        'تسوّق من آلاف المنتجات ببضع نقرات، وتمتع بتجربة مخصصة تناسب احتياجاتك، في أي وقت ومن أي مكان.',

    'onboarding_title_2': 'استلم طلباتك أينما كنت، وفي الوقت الذي يناسبك!',
    'onboarding_sub_title_2':
        'نوفر لك خيارات توصيل سريعة وآمنة، مع تتبع حقيقي لحالة الطلبية وتحديثات مباشرة حتى تصل إلى باب منزلك.',

    'onboarding_title_3': 'تحكم في كل طلبية بشكل ذكي، من الطلب إلى الاستلام!',
    'onboarding_sub_title_3':
        'تتبع طلباتك، عدّل التفاصيل، أو أعد الترتيب بسهولة عبر واجهة واضحة، مع دعم فني متاح على مدار الساعة لحل أي استفسار.',

    ///===========================================================================
    /// Login Screen

    ///===========================================================================
    /// App Exception
    'Invalid login credentials': 'بيانات تسجيل الدخول غير صحيحة',
    'Google sign in failed': 'فشل تسجيل الدخول بواسطة جوجل',
    'security_code_request': 'يمكنك طلب رمز الحماية مرة أخرى في غضون %s ثانية.',

    ///===========================================================================
    /// Authentication

    ///===========================================================================
    /// Home Screen
  };
}
